'''
Объявите класс WordString, объекты которого создаются командами:

w1 = WordString()
w2 = WordString(string)

где string - передаваемая строка. Например:

words = WordString("Python ООП")

Реализовать следующий функционал для объектов этого класса:
len(words) - должно возвращаться число слов в переданной строке (слова разделяются
одним или несколькими пробелами);
words(indx) - должно возвращаться слово по его индексу (indx - порядковый номер слова в
строке, начиная с 0).
Также в классе WordString реализовать объект-свойство (property):
string - для передачи и считывания строки.
Пример пользования классом WordString (эти строчки в программе писать не нужно):

words = WordString()
words.string = "Python ООП"
n = len(words)
first = "" if n == 0 else words(0)
print(words.string)
print(f"Число слов: {n}; первое слово: {first}")
'''

