# число десятков и единиц в 2значном числе
# сумма цифр 2знач числа
# число при перестановке цифр в 2знач числе
# 3знач число по цифрам через ,

# Считывает 1 строку if 'python', ДА иначе НЕТ
# Определяет, состоит ли 2знач число, введён с клавы, из одинак цифр и если состоти, то ДА иначе НЕТ
# Считывает 3 числа и подсчит кол-во чёт цифр
# Является ли заданное натуральное число 3значным
# Проверяет, что все цифры зад натрульного 3знач числа различны
# По координатам точки, не лежащим на осях координат определяет номер координатной четверти, в которой она находится
# Даны 3 целых числа. Определить, сколько среди них совпадают. Вывод: ВСЕ СОВПАДАЮТ, 2 СОВП, НИКАКОЕ НЕ СОВПАДАЕТ